app/controllers/galleries_controller.rb

  def index
    @gallery = Gallery.all
---
SELECT `galleries`.* FROM `galleries`

   def create
    @gallery = Gallery.new(gallery_params)
    if @gallery.save
---
INSERT INTO `galleries` (`content`, `created_at`, `picture_content_type`, `picture_file_name`, `picture_file_size`, `picture_updated_at`, `title`, `updated_at`) VALUES ('dsfds', '2015-03-26 03:27:10', 'image/png', 'Taeyeon.png', 28935, '2015-03-26 03:27:10', 'ghgfhgfh', '2015-03-26 03:27:10')

   def update
     @gallery = Gallery.find_by_id(params[:id])
      if @gallery.update(gallery_params)
---
SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 3 LIMIT 1
UPDATE `galleries` SET `picture_file_name` = 'Taeyeon.png', `picture_content_type` = 'image/png', `picture_file_size` = 28935, `picture_updated_at` = '2015-03-30 09:24:57', `updated_at` = '2015-03-30 09:24:57' WHERE `galleries`.`id` = 3

  def edit
    @gallery = Gallery.find_by_id(params[:id])
---
SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 3 LIMIT 1

  def destroy
     @gallery = Gallery.find_by_id(params[:id])
      if @gallery.destroy
---
SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 3 LIMIT 1
DELETE FROM `galleries` WHERE `galleries`.`id` = 3